src/Enums/ВариантыОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтветов</Name>
			<Comment>Используется в правах-настройках пользователей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спрашивать</Name>
					<Comment>Будет открыт диалог на выбор варианта: "Да" - выполнить действие "Нет" - отменить действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
					<Comment>Данное право (настройка) разрешает действие пользователю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
					<Comment>Данное право (настройка) запрещает действие пользователю</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеПерсональногоДоступа</Name>
					<Comment>Пользователь имеет собственные права и настройки, в группе доступа не участвует</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольККМ</Name>
					<Comment>Пароль-идентификатор кассира при работе с КММ(ФР)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпТекущийВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКассираPOS</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерфейсТСД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновнойДляСвязи</Name>
							<Comment>Основной вид контактной информации для связи</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СегментыКлиентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СегментКлиента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыКлиентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеПодразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Comment>Дополнительные характеристики номенклатуры</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.ТипыНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Comment>Дата изготовления серии номенклатуры</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Comment>Срок годности</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>Серийный номер номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Качество</Name>
					<Comment>Категория качества номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Comment>Порядковый номер характеристики, по которому производиться сортировка элементов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеСахара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Негоциант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Comment>Полный текст строкового дополнительного реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Справки2ЕГАИС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/УправлениеДиалогомСервер/Ext/Module.bsl
// Общий модуль "Управление диалогом (сервер)"


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Возвращает метаданные объекта, которому принадлежит переданная форма.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, для которой производиться получение объекта описания метаданных.
//
Функция ПолучитьМетаданныеОбъектаФормы(Форма) Экспорт
	
	// Определим имя формы
	ИмяФормы = ?(ТипЗнч(Форма)=Тип("Строка"), Форма, Форма.ИмяФормы);
	
	// Произведем разложение переданного имени на составляющие
	ЭлементыИмениОбъекта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяФормы, ".");
	
	// Формируем полное имя объекта метаданных
	ПолноеИмя = ЭлементыИмениОбъекта[0]+"."+ЭлементыИмениОбъекта[1];
	
	// Получаем объект описания метаданных по переданному имени
	Возврат Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	
КонецФункции // ПолучитьМетаданныеОбъектаФормы()

// Функция возвращает расширенное представление списка для переданного объекта.
//
Функция ПредставлениеСпискаОбъектов(Объект) Экспорт
	
	// Получим метаданные переданного объекта
	Если ТипЗнч(Объект)=Тип("УправляемаяФорма") Тогда
		ОбъектМетаданных = ПолучитьМетаданныеОбъектаФормы(Объект);
	ИначеЕсли ТипЗнч(Объект)=Тип("ОбъектМетаданных") Тогда
		ОбъектМетаданных = Объект;
	Иначе
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
	КонецЕсли;
	
	// Некоторые свойства представления могут не существовать для объектов данного типа.
	Представления = Новый Структура("РасширенноеПредставлениеСписка,ПредставлениеСписка");
	ЗаполнитьЗначенияСвойств(Представления, ОбъектМетаданных);
	
	// Проверим какое из свойств представления заполнено
	Если НЕ ПустаяСтрока(Представления.РасширенноеПредставлениеСписка) Тогда
		Возврат Представления.РасширенноеПредставлениеСписка;
		
	ИначеЕсли НЕ ПустаяСтрока(Представления.ПредставлениеСписка) Тогда
		Возврат Представления.ПредставлениеСписка;
		
	Иначе
		Возврат ОбъектМетаданных.Представление();
	КонецЕсли;
	
КонецФункции // ПредставлениеСпискаОбъектов()

// Функция возвращает расширенное представление объекта по переданному имени метаданных.
//
Функция ПредставлениеОбъект(Объект) Экспорт
	
	// Получим метаданные переданного объекта
	Если ТипЗнч(Объект)=Тип("УправляемаяФорма") Тогда
		ОбъектМетаданных = ПолучитьМетаданныеОбъектаФормы(Объект);
	ИначеЕсли ТипЗнч(Объект)=Тип("ОбъектМетаданных") Тогда
		ОбъектМетаданных = Объект;
	Иначе
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
	КонецЕсли;
	
	// Некоторые свойства представления могут не существовать для объектов данного типа.
	Представления = Новый Структура("РасширенноеПредставлениеОбъекта,ПредставлениеОбъекта");
	ЗаполнитьЗначенияСвойств(Представления, ОбъектМетаданных);
	
	// Проверим какое из свойств представления заполнено
	Если НЕ ПустаяСтрока(Представления.РасширенноеПредставлениеОбъекта) Тогда
		Возврат Представления.РасширенноеПредставлениеОбъекта;
		
	ИначеЕсли НЕ ПустаяСтрока(Представления.ПредставлениеОбъекта) Тогда
		Возврат Представления.ПредставлениеОбъекта;
		
	Иначе
		Возврат ОбъектМетаданных.Представление();
	КонецЕсли;
	
КонецФункции // ПредставлениеОбъект()

// Производит добавление в форму реквизитов в соответствии с переданной коллекцией.
//
// Параметры:
//  Форма - УправляемаяФорма  - Форма, в которую производиться добавление реквизитов.
//
Процедура ДобавитьРеквизитыФормы(Форма, Реквизиты) Экспорт
	
	// Проверяем целесообразность дальнейших операций
	Если Реквизиты.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	// Производим создание дополнительных реквизитов формы
	ПереченьНовыхРеквизитов = Новый Массив();
	Для каждого Реквизит Из Реквизиты Цикл
		ТипыРеквизита = Новый Массив();
		ТипыРеквизита.Добавить(ТипЗнч(Реквизит.Значение));
		ПереченьНовыхРеквизитов.Добавить(Новый РеквизитФормы(Реквизит.Ключ, Новый ОписаниеТипов(ТипыРеквизита)));
	КонецЦикла;
	Форма.ИзменитьРеквизиты(ПереченьНовыхРеквизитов);
	
	// Производим заполнение новых реквизит данными
	ЗаполнитьЗначенияСвойств(Форма, Реквизиты);
	
КонецПроцедуры // ДобавитьРеквизитыФормы()

// Установка/снятие пометок незаполненных реквизитов на формах документа.
//
// Параметры
//  Форма - УправляемаяФорма - Форма, на которой надо расставить пометки незаполненного
//  СписокОбязательныхРеквизитов  - СписокЗначений - Структура обязательных реквизитов
//                                     Если параметр не задан, то обязательные реквизиты будут получены 
//                                     из менеджера объекта
//  СнятиеСтарыхАвтоотметокНезаполненного  - Булево - Признак необходимости снятия пометок у всех элементов формы.
//
Процедура РасставитьАвтоотметкиНезаполненного(Форма, СписокОбязательныхРеквизитов=Неопределено, СнятиеСтарыхАвтоотметокНезаполненного=Истина, Объект = Неопределено) Экспорт
	
	ЗащищенныеФункцииСервер.РасставитьАвтоотметкиНезаполненного(Форма, СписокОбязательныхРеквизитов, СнятиеСтарыхАвтоотметокНезаполненного, Объект);
	
КонецПроцедуры // РасставитьАвтоотметкиНезаполненного()

Процедура ОбновитьПараметрВыбора(ПараметрыВыбора, ИмяПараметра, ЗначениеПараметра) Экспорт
	
	Если ТипЗнч(ЗначениеПараметра)=Тип("Массив") Тогда
		Если ЗначениеПараметра.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		НовыйПараметрВыбора = Новый ПараметрВыбора(ИмяПараметра, Новый ФиксированныйМассив(ЗначениеПараметра));
	Иначе
		НовыйПараметрВыбора = Новый ПараметрВыбора(ИмяПараметра, ЗначениеПараметра);
	КонецЕсли;
	
	ОбновитьФиксированныйМассивПараметровВыбора(ПараметрыВыбора, НовыйПараметрВыбора);
	
КонецПроцедуры // ОбновитьПараметрВыбора()

Процедура УдалитьПараметрВыбора(ПараметрыВыбора, ИмяПараметра) Экспорт
	
	ОбновитьФиксированныйМассивПараметровВыбора(ПараметрыВыбора, ИмяПараметра);
	
КонецПроцедуры // УдалитьПараметрВыбора()

Процедура ОбновитьФиксированныйМассивПараметровВыбора(КоллекцияПараметровВыбора, НовыйПараметрВыбора) Экспорт
	
	НоваяКоллекцияПараметров = Новый Массив;
	
	Если ТипЗнч(НовыйПараметрВыбора)=Тип("Строка") Тогда
		ИмяПараметра = НовыйПараметрВыбора;
	Иначе
		ИмяПараметра = НовыйПараметрВыбора.Имя;
		НоваяКоллекцияПараметров.Добавить(НовыйПараметрВыбора);
	КонецЕсли;
	
	Для Каждого ПараметрВыбора Из КоллекцияПараметровВыбора Цикл
		Если ПараметрВыбора.Имя=ИмяПараметра Тогда
			Продолжить;
		КонецЕсли;
		НоваяКоллекцияПараметров.Добавить(ПараметрВыбора);
	КонецЦикла;
	
	КоллекцияПараметровВыбора = Новый ФиксированныйМассив(НоваяКоллекцияПараметров);
	
КонецПроцедуры // ОбновитьФиксированныйМассивПараметровВыбора()

// Процедура устанавливает признак запрета открытия формы документа из обработки ввода на основании.
//
Процедура ЗапретитьОткрытиеФормыОбъекта(ВходнойОбъект, ТекстСообщения) Экспорт
	
	ВывестиСообщение(ТекстСообщения, ВходнойОбъект, "ОтменитьОткрытие",, Истина);
	
КонецПроцедуры // ЗапретитьОткрытиеФормыОбъекта)

// Процедура проверки сообщений пользователю и определения состояния отказа
//
Функция ПроверитьВозможностьОткрытияФормыОбъекта(Форма, Отказ=ЛОЖЬ) Экспорт
	
	СообщенияПользователю = ПолучитьСообщенияПользователю();
	
	Для Каждого Сообщение Из СообщенияПользователю Цикл
		Если Сообщение.Поле="ОтменитьОткрытие" Тогда
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат (НЕ Отказ);
	
КонецФункции // ПроверитьВозможностьОткрытияФормыОбъекта()

// Процедура настраивает форму и производит блокирование элементов формы.
//
// Параметры
//  Форма                - УправляемаяФорма - Форма, на которой надо расставить пометки незаполненного
//  БлокируемыеРеквизиты - СписокЗначений   - Список элементов для блокировки
//  ИмяСобытия           - Строка           - Имя события, при работе которого необходимо проверить блокировку
//  ЭтоРегистр           - Булево           - Признак вызова процедуры из регистра.
//
Процедура БлокироватьЭлементыФормы(Форма, БлокируемыеРеквизиты, ЭтоРегистр=Ложь, Объект=Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	ПервоеЧтениеОбъекта = НЕ ЕстьРеквизит(Форма,"ИзменениеЗапрещено");
	Создание = НЕ ПервоеЧтениеОбъекта И Форма.Параметры.Свойство("ЗакрыватьПриВыборе");
	ИзменениеЗапрещено = Ложь;
	
	// Проверим даты запрета изменения. Если форма уже заблокирована "из вне", то в проверке нет смысла.
	Если ПервоеЧтениеОбъекта И НЕ Форма.ТолькоПросмотр Тогда
		
		// Вызываем обработчик проверки доступности изменений
		Если ЭтоРегистр Тогда
			ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(Форма, Форма.Запись.ИсходныйКлючЗаписи);
		Иначе
			ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(Форма, Объект.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверим возможность редактирования документов другого автора
	Если НЕ Форма.ТолькоПросмотр И Объект<>Неопределено	И ЗначениеЗаполнено(Объект.Ссылка)
		И Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект.Ссылка)) И ЕстьРеквизит(Объект, "Автор")
		И ПравоПользователя("РедактированиеТолькоСвоихДокументов", Объект) И Объект.Автор<>ПараметрыСеанса.ТекущийПользователь Тогда
		ВывестиСообщение(НСтр("ru='Недостаточно прав для редактирования документа, созданного другим пользователем.'"), Объект);
		Форма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если НЕ Форма.ТолькоПросмотр И Объект<>Неопределено	И ЗначениеЗаполнено(Объект.Ссылка)
		И Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект.Ссылка))
		И ЕстьРеквизит(Объект, "ПортфельКатегорий") И ЗначениеЗаполнено(Объект.ПортфельКатегорий)
		И ПравоПользователя("РедактированиеДокументаТолькоМенеджеромПортфеля", Объект) Тогда
		
		текПользователь = ПараметрыСеанса.ТекущийПользователь;
		НашлиМенеджера = Ложь;
		Для Каждого текМенеджер Из Объект.ПортфельКатегорий.Менеджеры Цикл
			начПериода = текМенеджер.НачалоПериода;
			конПериода = текМенеджер.КонецПериода;
			ДатаОбъекта = Объект.Дата;
			
			Если текМенеджер.Менеджер=ПараметрыСеанса.ТекущийПользователь И (НЕ ЗначениеЗаполнено(начПериода) ИЛИ начПериода<=ДатаОбъекта) И (НЕ ЗначениеЗаполнено(конПериода) ИЛИ конПериода>=ДатаОбъекта) Тогда
				НашлиМенеджера = Истина;;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ НашлиМенеджера Тогда
			ВывестиСообщение(НСтр("ru='Редактирование документа, разрешено только менеджерам портфеля, указанного в данном документе.'"), Объект);
			Форма.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Проверим возможность редактирования документа при наличии подчиненных документов.
	Если НЕ Форма.ТолькоПросмотр И НЕ ЭтоРегистр 
		И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УправлениеДиалогомДокументаСервер.ПроверитьНаличиеПодчиненныхДокументов(Форма, Объект.Ссылка);
	КонецЕсли;
	
	// Производим создание дополнительных реквизитов
	Если Создание Тогда
		Форма.ИзменениеЗапрещено = Форма.ТолькоПросмотр;
	КонецЕсли;
	
	// Настраиваем подменю утверждения документов.
	Если НЕ ПервоеЧтениеОбъекта И Форма.Элементы.Найти("ПодменюУтверждениеДокументов") <> Неопределено Тогда
		УтверждениеДокументовСервер.УстановитьДоступностьФормыДляРедактирования(Форма, Форма.ИзменениеЗапрещено, Объект);
		УтверждениеДокументовКлиентСервер.УстановитьДоступностьКнопокУтверждения(Форма, Объект, Форма.ИзменениеЗапрещено);
	КонецЕсли;
	ИзменениеЗапрещено = Форма.ТолькоПросмотр;
	
	// Проверим переданный список блокируемых реквизитов.
	Если НЕ ПервоеЧтениеОбъекта И БлокируемыеРеквизиты.Количество() > 0 Тогда
		
		// Если вся форма заблокирована, то смысл блокировать еще что-то.
		ЗапретРедактированияРеквизитовОбъектовСлужебный.ПодготовитьФорму(Форма, Объект, Форма.Элементы.ДополнительныеДействия, "", БлокируемыеРеквизиты);
		Если НЕ ИзменениеЗапрещено Тогда
			ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(Форма,,, Объект);
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("РазрешитьРедактированиеРеквизитовОбъекта")=Неопределено Тогда
			Форма.Элементы.РазрешитьРедактированиеРеквизитовОбъекта.Доступность = НЕ ИзменениеЗапрещено;
		КонецЕсли;
		
	КонецЕсли;
	
	// Для справочников заблокируем редактирование кода
	ЭлементСуществует = НЕ (Форма.Элементы.Найти("Код") = Неопределено);
	Если ЭлементСуществует И Объект <> Неопределено И Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект.ссылка))  Тогда
		Форма.Элементы.Код.Доступность =    ПравоПользователя("РазрешитьРедактированиеКодовСправочников", Объект) = Перечисления.ВариантыОтветов.Да
										ИЛИ ПравоПользователя("РазрешитьРедактированиеКодовСправочников", Объект) = Перечисления.ВариантыОтветов.Спрашивать;
		Если ПравоПользователя("РазрешитьРедактированиеКодовСправочников", Объект) = Перечисления.ВариантыОтветов.Да Тогда
			Форма.Элементы.Код.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
		КонецЕсли;
	КонецЕсли;
	
	// Для Документов заблокируем редактирование Номера
	ЭлементНомерСуществует  = Форма.Элементы.Найти("Номер");
	ЭлементДатаСуществует   = Форма.Элементы.Найти("Дата");
	Если Объект <> Неопределено  Тогда
		ЭтоОбъектДокумент       = Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект.Ссылка));
		
		Если ЭтоОбъектДокумент Тогда
			ЕстьПравоРедактировать  = ПравоПользователя("РазрешитьРедактированиеНомеровДокументов", Объект);
			РедактированиеЗапрещено = НЕ ПравоПользователя("ОткрытиеФормыПараметрыДокументаВРежимеРедактирование", Объект);
			Если ЭлементНомерСуществует <> Неопределено Тогда
				ЭлементНомерСуществует.Доступность    = (ЕстьПравоРедактировать = Перечисления.ВариантыОтветов.Да) ИЛИ (ЕстьПравоРедактировать = Перечисления.ВариантыОтветов.Спрашивать);
				ЭлементНомерСуществует.ТолькоПросмотр = РедактированиеЗапрещено;
				Если ЕстьПравоРедактировать = Перечисления.ВариантыОтветов.Да Тогда
					ЭлементНомерСуществует.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
				КонецЕсли;
			КонецЕсли;
			Если ЭлементДатаСуществует <> Неопределено Тогда
				ЭлементДатаСуществует.ТолькоПросмотр  = РедактированиеЗапрещено;
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли;
	
	//Семья
	Если Форма.Элементы.Найти("Скидки") <> Неопределено И Форма.Элементы.Найти("ДокументЦентральногоОфиса") <> Неопределено Тогда
		Если Объект <> Неопределено Тогда
			Если Объект.ДокументЦентральногоОфиса Тогда
				Форма.Элементы.Скидки.Доступность = ПравоПользователя("ПравоВводаДокументовЦО", Объект);
			КонеЦесли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Используется в механизме взаимодействий. Формирует текст запроса по контактам предмета взаимодействия.
//
// Параметры:
//  Ссылка                - Ссылка  - Содержит ссылку на передаваемый объект метаданных.
//  ДополнительныеПараметры - Структура - необязательные параметры:
//   * ТекстВременнаяТаблица - Строка  - Строка в которой может находиться часть текста запроса, которая отвечает за
//                                    помещение результата запроса во временную таблицу.
//   * Объединить            - Булево  - Признак который указывает на режим формирования запроса. В случае, если данный
//                                    параметр имеет значение Истина, то формируемый в функции запрос являются частью
//                                    другого запроса и должен начинаться с конструкции ОБЪЕДИНИТЬ.
//   * ТолькоОсновныеКонтакты - Булево - Признак, который указывает на необходимость вывода только основных контактов.
//   * ПоляОсновные           - Строка - Список основных полей поиска контактов.
//   * ПоляДополнительные     - Строка - Список дополнительных полей поиска контактов.
//
// Возвращаемое значение:
//  Строка - Возвращаемая строка, содержащая в себе текст запроса по контактам предмета взаимодействий.
//
Функция ПолучитьТекстЗапросаПоКонтактам(Ссылка, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если ДополнительныеПараметры=Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	Если НЕ ДополнительныеПараметры.Свойство("ТекстВременнаяТаблица") Тогда
		ДополнительныеПараметры.Вставить("ТекстВременнаяТаблица", "");
	КонецЕсли;
	Если НЕ ДополнительныеПараметры.Свойство("Объединить") Тогда
		ДополнительныеПараметры.Вставить("Объединить", Ложь);
	КонецЕсли;
	Если НЕ ДополнительныеПараметры.Свойство("ТолькоОсновныеКонтакты") Тогда
		ДополнительныеПараметры.Вставить("ТолькоОсновныеКонтакты", Истина);
	КонецЕсли;
	Если НЕ ДополнительныеПараметры.Свойство("ПоляОсновные") Тогда
		ДополнительныеПараметры.Вставить("ПоляОсновные", "");
	КонецЕсли;
	Если НЕ ДополнительныеПараметры.Свойство("ПоляДополнительные") Тогда
		ДополнительныеПараметры.Вставить("ПоляДополнительные", "");
	КонецЕсли;
	
	// Получим имя таблицы
	ИмяТаблицы = Ссылка.Метаданные().ПолноеИмя();
	
	// Сформируем список необходимых полей
	Если НЕ ДополнительныеПараметры.ТолькоОсновныеКонтакты И ЗначениеЗаполнено(ДополнительныеПараметры.ПоляДополнительные) Тогда
		ДополнительныеПараметры.ПоляОсновные = ДополнительныеПараметры.ПоляОсновные +"," + ДополнительныеПараметры.ПоляДополнительные;
	КонецЕсли;
		
	СписокПолей = Новый Структура(ДополнительныеПараметры.ПоляОсновные);
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	Если НЕ ДополнительныеПараметры.ТолькоОсновныеКонтакты Тогда
		Если ЕстьРеквизит(ОбъектМетаданных,"Автор") Тогда
			СписокПолей.Вставить("Автор");
		КонецЕсли;
		Если ЕстьРеквизит(ОбъектМетаданных,"Менеджер") Тогда
			СписокПолей.Вставить("Менеджер");
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьРеквизит(ОбъектМетаданных,"Контрагент") Тогда
		СписокПолей.Вставить("Контрагент");
	КонецЕсли;
	
	// Сформируем текст запроса
	ТекстЗапроса = "";
	ТекстПроРазрешенные = ?(ДополнительныеПараметры.Объединить,""," РАЗРЕШЕННЫЕ");
	ТекстОбъединить = "";
	ШаблонУсловияНаСсылки = Взаимодействия.ПолучитьШаблонУсловияНаСсылкиКонтактовДляЗапроса();
	МассивОписанияТиповКонтактов = ВзаимодействияКлиентСервер.МассивОписанияВозможныхКонтактов();
	ШаблонУсловияПустойСсылки =  "НЕ Таблица.%ИмяПоля% = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Для каждого ЭлементМассиваОписания Из МассивОписанияТиповКонтактов Цикл
		Если ЭлементМассиваОписания.Имя = "Пользователи" Тогда
			Продолжить;
		Иначе
			ШаблонУсловияПустойСсылки = ШаблонУсловияПустойСсылки + "
			|И НЕ Таблица.%ИмяПоля% = ЗНАЧЕНИЕ(Справочник." + ЭлементМассиваОписания.Имя + ".ПустаяСсылка)";
		КонецЕсли;
	КонецЦикла;

	Для Каждого Поле Из СписокПолей Цикл
		ИмяПоля = Поле.Ключ;
		УсловиеНаСсылки = СтрЗаменить(ШаблонУсловияНаСсылки, "%ИмяПоля%", ИмяПоля);
		УсловиеПустойСсылки = СтрЗаменить(ШаблонУсловияПустойСсылки, "%ИмяПоля%", ИмяПоля);
		ТекстЗапроса = ТекстЗапроса + (ТекстОбъединить
		+ "ВЫБРАТЬ" + ТекстПроРазрешенные + " РАЗЛИЧНЫЕ
		|	Таблица." + ИмяПоля + " КАК Контакт
		|" + ДополнительныеПараметры.ТекстВременнаяТаблица + "ИЗ
		|" + ИмяТаблицы + " КАК Таблица
		|	ГДЕ
		|     Таблица.Ссылка = &Предмет
		|     И " + УсловиеПустойСсылки);
		ТекстПроРазрешенные = "";
		ДополнительныеПараметры.ТекстВременнаяТаблица = "";
		ТекстОбъединить = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
		
	КонецЦикла;
	
	Если ДополнительныеПараметры.Объединить Тогда
		ТекстЗапроса = "
		| ОБЪЕДИНИТЬ ВСЕ
		|" + ТекстЗапроса;
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаПоКонтактам()

// Используется в механизме взаимодействий. Формирует список контактов предмета взаимодействия.
//
// Параметры:
//  Ссылка - Ссылка - Содержит ссылку на передаваемый объект метаданных.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив, содержащий в себе перечень контактов предмета взаимодействий.
//
Функция ПолучитьКонтактыВзаимодействий(Ссылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
	Запрос = Новый Запрос;
	Попытка
		Запрос.Текст = МенеджерОбъекта.ПолучитьТекстЗапросаПоКонтактам(Ссылка);
	Исключение
		Запрос.Текст = УправлениеДиалогомСервер.ПолучитьТекстЗапросаПоКонтактам(Ссылка);
	КонецПопытки;
	Запрос.УстановитьПараметр("Предмет",Ссылка);
	
	НачатьТранзакцию();
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Результат = Неопределено;
		Иначе
			Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контакт");
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ПолучитьКонтактыВзаимодействий()

// Функция возвращает индекс картинки для переданного объекта метаданных
Функция ПолучитьИндексКартинкиВидаОбъектаМетаданных(ОбъектМетаданных) Экспорт
	Индекс = 0;
	Если ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
		Индекс = 4;
	ИначеЕсли ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
		Индекс = 5;
	ИначеЕсли ОбщегоНазначения.ЭтоПеречисление(ОбъектМетаданных) Тогда
		Индекс = 7;
	ИначеЕсли ОбщегоНазначения.ЭтоПланОбмена(ОбъектМетаданных) Тогда
		Индекс = 10;
	ИначеЕсли ОбщегоНазначения.ЭтоПланВидовХарактеристик(ОбъектМетаданных) Тогда
		Индекс = 11;
	ИначеЕсли ОбщегоНазначения.ЭтоБизнесПроцесс(ОбъектМетаданных) Тогда
		Индекс = 18;
	ИначеЕсли ОбщегоНазначения.ЭтоЗадача(ОбъектМетаданных) Тогда
		Индекс = 19;
	ИначеЕсли ОбщегоНазначения.ЭтоПланСчетов(ОбъектМетаданных) Тогда
		Индекс = 12;
	ИначеЕсли ОбщегоНазначения.ЭтоПланВидовРасчета(ОбъектМетаданных) Тогда
		Индекс = 13;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрСведений(ОбъектМетаданных) Тогда
		Индекс = 14;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрНакопления(ОбъектМетаданных) Тогда
		Индекс = 15;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрБухгалтерии(ОбъектМетаданных) Тогда
		Индекс = 16;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрРасчета(ОбъектМетаданных) Тогда
		Индекс = 17;
	ИначеЕсли ОбщегоНазначения.ЭтоКонстанта(ОбъектМетаданных) Тогда
		Индекс = 3;
	ИначеЕсли ОбщегоНазначения.ЭтоЖурналДокументов(ОбъектМетаданных) Тогда
		Индекс = 6;
	КонецЕсли;
	
	Возврат Индекс;
КонецФункции

// Добавляет перечень объектов в ПараметрыДействия для оповещения динамических списков после окончания действия.
//
// Параметры:
//  ОбъектОповещения  - Произвольный - Объект, который будут обновлены в динамических списках (ссылки или типы).
//  ПараметрыДействия - Структура    - Набор параметров, в который будут записаны параметры оповещения.
//
Процедура ДобавитьОповещениеДинамическихСписков(ОбъектОповещения, ПараметрыДействия) Экспорт
	
	// Проверяем тип параметров действия.
	Если НЕ ТипЗнч(ПараметрыДействия) = Тип("Структура") Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Проверяем наличие необходимого свойства в структуре.
	Если НЕ ПараметрыДействия.Свойство("ОповещениеДинамическихСписков") Тогда
		ПараметрыДействия.Вставить("ОповещениеДинамическихСписков", Новый Структура("Использование, СсылкаИлиТип", Истина, Новый Массив));
	КонецЕсли;
	
	// Взводим флаг необходимости оповещения.
	ПараметрыДействия.ОповещениеДинамическихСписков.Использование = Истина;
	
	// Проверяем тип свойства с перечнем объектов в структуре.
	Если НЕ ТипЗнч(ПараметрыДействия.ОповещениеДинамическихСписков.СсылкаИлиТип)=Тип("Массив") Тогда
		
		// Запоминаем старое значение.
		ПредыдущееЗначениеСсылкаИлиТип = ПараметрыДействия.ОповещениеДинамическихСписков.СсылкаИлиТип;
		
		// Приводим тип свойства с перечнем объектов к массиву.
		ПараметрыДействия.ОповещениеДинамическихСписков.СсылкаИлиТип = Новый Массив;
		
		// Если было передано одиночное значение, добавляем его в массив объектов.
		Если ЗначениеЗаполнено(ПредыдущееЗначениеСсылкаИлиТип) Тогда
			ПараметрыДействия.ОповещениеДинамическихСписков.СсылкаИлиТип.Добавить(ПредыдущееЗначениеСсылкаИлиТип);
		КонецЕсли;
		
	КонецЕсли;
	
	// Добавляем в массив объекты для их оповещения
	ПараметрыДействия.ОповещениеДинамическихСписков.СсылкаИлиТип.Добавить(ОбъектОповещения);
	
КонецПроцедуры // ДобавитьОповещениеДинамическихСписков()

// Добавляет свойство в ПараметрыДействия для оповещения открытых форм после окончания действия.
//
// Параметры:
//  ИмяСобытия  -  Строка - Имя события. Может быть использовано для идентификации сообщений принимающими их формами.
//  Параметр    -  Произвольный - Параметр сообщения. Могут быть переданы любые необходимые данные.
//  Источник    -  Произвольный - Источник события. Например, в качестве источника может быть указана другая форма.
//  ПараметрыДействия  - Структура - Набор параметров, в который будут записаны параметры оповещения.
//
Процедура ДобавитьОповещениеФорм(ИмяСобытия, Параметр=Неопределено, Источник=Неопределено, ПараметрыДействия=Неопределено) Экспорт
	
	// Проверяем тип параметров действия.
	Если НЕ ТипЗнч(ПараметрыДействия) = Тип("Структура") Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Проверяем наличие необходимого свойства в структуре.
	Если НЕ ПараметрыДействия.Свойство("ОповещениеФорм") Тогда
		ПараметрыДействия.Вставить("ОповещениеФорм", Новый Массив);
		
	ИначеЕсли ТипЗнч(ПараметрыДействия.ОповещениеФорм)=Тип("Структура") Тогда
		
		// Преобразовываем структуру в массив структур.
		ОповещениеФорм = ПараметрыДействия.ОповещениеФорм;
		
		ПараметрыДействия.ОповещениеФорм = Новый Массив;
		ПараметрыДействия.ОповещениеФорм.Добавить(ОповещениеФорм);
		
	КонецЕсли;
	
	// Добавляем новое оповещение в массив структур.
	НовоеОповещениеФорм = Новый Структура;
	НовоеОповещениеФорм.Вставить("Использование", Истина);
	НовоеОповещениеФорм.Вставить("ИмяСобытия",    ИмяСобытия);
	НовоеОповещениеФорм.Вставить("Параметр",      Параметр);
	НовоеОповещениеФорм.Вставить("Источник",      Источник);
	ПараметрыДействия.ОповещениеФорм.Добавить(НовоеОповещениеФорм);
	
КонецПроцедуры // ДобавитьОповещениеФорм()

// Выполняет свертку таблицы по заданному реквизиту
//
Функция СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, ИмяРеквизита) Экспорт
	
	Таблица = ТаблицаРеквизитыДокументов.Скопировать();
	Таблица.Свернуть(ИмяРеквизита);
	Возврат Таблица;
	
КонецФункции // СвернутьТаблицуЗначенийПоРеквизиту()

// Возвращает модуль числа
//
// Параметры:
//  Х - Число - Исходное число
// Возвращаемое значение:
//  Число - модуль исходного числа.
//
Функция ПолучитьМодульЧисла(Икс) Экспорт
	
	Возврат ?(Икс >= 0, Икс, -Икс);
	
КонецФункции // ПолучитьМодульЧисла()

// Возвращает тип истинного объекта по данным формы
//
Функция ПолучитьТипОбъектаПоДаннымФормы(Объект) Экспорт
	
	Возврат ИзXMLТипа(СтрЗаменить(XMLТипЗнч(Объект.Ссылка).ИмяТипа, "Ref.", "Object."), "");
	
КонецФункции // ПолучитьТипОбъектаПоДаннымФормы()

// Возвращает структуру данных с указанными реквизитам объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется формирование представления итогов.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//              Служебные поля для получения данных: _ИтогиОпераций, _Константа, _Право.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов с префиксом "Представление".
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура.
//
//
Функция ПолучитьДанныеОбъекта(Объект, Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты)=Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		Реквизиты = СтрРазделить(Реквизиты, ",", Ложь);
	КонецЕсли;
	
	РеквизитыОбъекта = Новый Структура;
	Если ТипЗнч(Реквизиты)=Тип("Структура") ИЛИ ТипЗнч(Реквизиты)=Тип("ФиксированнаяСтруктура") Тогда
		РеквизитыОбъекта = Реквизиты;
		
	ИначеЕсли ТипЗнч(Реквизиты)=Тип("Массив") ИЛИ ТипЗнч(Реквизиты)=Тип("ФиксированныйМассив") Тогда
		Для Каждого Реквизит Из Реквизиты Цикл
			ИмяПоля = СтрЗаменить(Реквизит, ".", "");
			РеквизитыОбъекта.Вставить(ИмяПоля, Реквизит);
		КонецЦикла;
		
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Неверный тип второго параметра ""Реквизиты"": %1'"), Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
	ДанныеОбъекта = Новый Структура;
	
	// Сформируем запрос по представлению данных.
	Запрос = Новый Запрос;
	ПоляЗапроса = Новый Массив;
	
	Для Каждого КлючИЗначение Из РеквизитыОбъекта Цикл
		
		ИмяПоля    = КлючИЗначение.Ключ;
		ПолныйПуть = КлючИЗначение.Значение;
		
		// Получим значение реквизита.
		Если ИмяПоля="_ИтогиОперации" Тогда
			ИтогиОперации = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка).РассчитатьИтогиОперации(Объект);
			ДанныеОбъекта.Вставить(ИмяПоля, ИтогиОперации);
			Продолжить;
			
		ИначеЕсли СтрНачинаетсяС(ИмяПоля, "_Константа") Тогда
			ИмяКонстанты = СтрЗаменить(ИмяПоля, "_Константа", "");
			Если Метаданные.Константы.Найти(ИмяКонстанты) <> Неопределено Тогда
				Значение = Константы[ИмяКонстанты].Получить();
			КонецЕсли;
			
		ИначеЕсли СтрНачинаетсяС(ИмяПоля, "_Право") Тогда
			ИмяПрава = СтрЗаменить(ИмяПоля, "_Право", "");
			Попытка
				Значение = ПравоПользователя(ИмяПрава, Объект);
			Исключение
				ПричинаОшибки(ИмяПрава, ПолныйПуть, Объект);
			КонецПопытки;
			
		Иначе
			
			Значение = Объект;
			Для Каждого ИмяРеквизита Из СтрРазделить(ПолныйПуть, ".", ЛОЖЬ) Цикл
				Если ЕстьРеквизит(Значение, ИмяРеквизита) Тогда
					Значение = Значение[ИмяРеквизита];
				Иначе
					Значение = NULL;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		ДанныеОбъекта.Вставить(ИмяПоля, Значение);
		
		Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Значение)) Тогда
			ПоляЗапроса.Добавить(СтрШаблон("	ПРЕДСТАВЛЕНИЕ(&%1) КАК %1Представление", ИмяПоля));
			Запрос.УстановитьПараметр(ИмяПоля, Значение);
			ДанныеОбъекта.Вставить(ИмяПоля+"Представление", Неопределено);
		КонецЕсли;
		
	КонецЦикла;
	
	// Получим структуру представлений данных объекта.
	Если Запрос.Параметры.Количество() > 0 Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ " + Символы.ПС + СтрСоединить(ПоляЗапроса, ","+Символы.ПС);
		Запрос.Текст = ТекстЗапроса;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Выборка);
		
	КонецЕсли;
	
	Возврат ДанныеОбъекта;
	
КонецФункции // ПолучитьДанныеОбъекта()

// Функция проверки блокировки данных объекта другим пользователем в системе
//
// Параметры:
//  Форма     - УправляемаяФорма     - Форма, в которой возникло событие.
//  Объект    - ДанныеФормыСтруктура - Объект, для которого проверяется блокировка данных.
//
// Возвращаемое значение:
//  Булево - Истина: Объект заблокирован другим пользователем; Ложь: Доступен для редактирования.
//
Функция ПроверитьЗапретРедактированияДанных(Знач Ссылка, УникальныйИдентификаторФормы) Экспорт
	
	// Если это новый объект, то блокировку не накладываем.
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Ссылка,, УникальныйИдентификаторФормы);
		Возврат Ложь;
	Исключение
		Возврат Истина;
	КонецПопытки;
	
КонецФункции // ПроверитьЗапретРедактированияДанных()

// Формирует значение реквизита по умолчанию.
//
// Параметры:
//  Форма             - УправляемаяФорма     - Форма объекта;
//  Объект            - ДанныеФормыСтруктура - Объект, для которого формируется наименование;
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции;
//  ИмяРеквизита      - Строка               - имя реквизита, для которого формируется значение по умолчанию.
//
&НаСервере
Процедура СформироватьЗначениеПоУмолчанию(Форма,
			Объект=Неопределено,
			ПараметрыДействия=Неопределено,
			ИмяРеквизита="Наименование") Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	КэшИмяРеквизита = "Кэш" + ИмяРеквизита;
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("Объект", Объект);
	ПараметрыВыполнения.Вставить("ПараметрыДействия", ПараметрыДействия);
	
	Имя = СтрЗаменить(Строка(МенеджерОбъекта), "СправочникМенеджер", "Справочники");
	Имя = Имя + ".Сформировать" + ИмяРеквизита + "ПоУмолчанию(Параметры.Объект, Параметры.ПараметрыДействия)";
	
	Наименование = РаботаВБезопасномРежиме.ВычислитьВБезопасномРежиме(Имя, ПараметрыВыполнения);
	Наименование = СокрЛП(Наименование);
	
	Форма.Элементы[ИмяРеквизита].СписокВыбора.Очистить();
	ПредставлениеНаименования = ?(ЗначениеЗаполнено(Наименование),
									Наименование,
									"<" + НСтр("ru = 'не заполнены реквизиты для автоформирования'") + ">");
	Форма.Элементы[ИмяРеквизита].СписокВыбора.Добавить(Наименование, ПредставлениеНаименования);
	
	Если ЗначениеЗаполнено(Форма[КэшИмяРеквизита]) И СокрЛП(Форма[КэшИмяРеквизита]) = СокрЛП(Объект[ИмяРеквизита])
		ИЛИ (ЗначениеЗаполнено(Наименование) И НЕ ЗначениеЗаполнено(Объект[ИмяРеквизита])) Тогда
		
		Объект[ИмяРеквизита]   = Наименование;
		Форма[КэшИмяРеквизита] = Наименование;
		
	КонецЕсли;
	
КонецПроцедуры // СформироватьНаименованиеПоУмолчанию()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Общий обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
Процедура ОбработкаРезультатаОповещения(Форма, РезультатОповещения, ДополнительныеПараметры=Неопределено, Объект = Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Обработаем в зависимости от переданного параметра события
	Если ДополнительныеПараметры="ПараметрыПечатиСписок" Тогда
		
		ФормаИсточник = Сред(Форма.ИмяФормы, СтрНайти(Форма.ИмяФормы, ".", НаправлениеПоиска.СКонца) + 1);
		
		Если ФормаИсточник = "ФормаСписка" Тогда
			
			// Для формы списка получим объект и запишем в него значения
			ТекущийОбъект = РезультатОповещения.СсылкаНаОбъект.ПолучитьОбъект();
			
			Для каждого РеквизитПечати Из РезультатОповещения.МассивДополнительныхРеквизитов Цикл
				РеквизитПечатиВДополнительныхРеквизитах = ТекущийОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", РеквизитПечати.Свойство));
				Если РеквизитПечатиВДополнительныхРеквизитах.Количество() = 0 Тогда
					// Добавим новый реквизит в таблицу дополнительных реквизитов
					Если ЗначениеЗаполнено(РеквизитПечати.Значение) Тогда
						НоваяСтрока = ТекущийОбъект.ДополнительныеРеквизиты.Добавить();
						НоваяСтрока.Свойство = РеквизитПечати.Свойство;
						НоваяСтрока.Значение = РеквизитПечати.Значение;
					КонецЕсли;
				Иначе
					// Изменим значение реквизита в таблице дополнительных реквизитов
					// или удалим устаревшее значение дополнительного реквизита.
					Если ЗначениеЗаполнено(РеквизитПечати.Значение) И НЕ РеквизитПечати.Значение = РеквизитПечатиВДополнительныхРеквизитах[0].Значение Тогда
						РеквизитПечатиВДополнительныхРеквизитах[0].Значение = РеквизитПечати.Значение;
					ИначеЕсли НЕ ЗначениеЗаполнено(РеквизитПечати.Значение) Тогда
						ТекущийОбъект.ДополнительныеРеквизиты.Удалить(РеквизитПечатиВДополнительныхРеквизитах[0]);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Попытка
				ТекущийОбъект.ОбменДанными.Загрузка = ИСТИНА;
				ТекущийОбъект.Записать();
			Исключение
				ВывестиСообщение(НСтр("ru = 'При записи данных возникла ошибка:%1%2'"),,,,,Символы.ПС,ОписаниеОшибки());
			КонецПопытки;
			
		ИначеЕсли ФормаИсточник = "ФормаДокумента" Тогда
			
			// Для формы документа запишем значения в реквизиты формы
			Для каждого РеквизитПечати Из РезультатОповещения.МассивДополнительныхРеквизитов Цикл
				РеквизитыФормы = Форма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", РеквизитПечати.Свойство));
				Если РеквизитыФормы.Количество() > 0 Тогда
					Форма[РеквизитыФормы[0].ИмяРеквизитаЗначение] = РеквизитПечати.Значение;
				КонецЕсли;
			КонецЦикла;
			
			Форма.Модифицированность = Истина;
			
		КонецЕсли;
		
	ИначеЕсли ДополнительныеПараметры="ПараметрыПечатиОбъект" Тогда
		
		Модифицировано = Ложь;
		Для каждого РеквизитПечати Из РезультатОповещения.МассивДополнительныхРеквизитов Цикл
			
			// Изменим свойство дополнительного реквизита
			Для каждого СтрокаСвойств Из Форма.Свойства_ОписаниеДополнительныхРеквизитов Цикл
				Если СтрокаСвойств.Свойство = РеквизитПечати.Свойство И НЕ Форма[СтрокаСвойств.ИмяРеквизитаЗначение] = РеквизитПечати.Значение Тогда
					Форма[СтрокаСвойств.ИмяРеквизитаЗначение] = РеквизитПечати.Значение;
					Модифицировано = Истина;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		Форма.Модифицированность = Модифицировано;
		
	ИначеЕсли ЛЕВ(ДополнительныеПараметры, 17)="КомандаЗаполнения" Тогда
		
		// Вызываем общий обработчик заполнения объекта
		ЗащищенныеФункцииСервер.ВыполнитьЗаполнениеОбъекта(Форма, РезультатОповещения, ДополнительныеПараметры, Объект);
		
		// !!! вынести в защищенную обработку Обновим служебные реквизиты Алкогольной продукции
		Если ЕстьРеквизит(Объект, "АлкогольнаяПродукция", "Товары") И ЕстьРеквизит(Объект,, "Марки") Тогда
			ЗащищенныеФункцииСервер.ЗаполнитьРеквизитАлкогольнойПродукции(Объект, Объект.Товары, Объект.Марки);
		КонецЕсли;
		
	ИначеЕсли ДополнительныеПараметры="ПодборНоменклатуры" Тогда
		ОбработкаРезультатаПодбораНоменклатуры(Форма, РезультатОповещения, Объект);
		
	ИначеЕсли ДополнительныеПараметры="ПодборПоПартиям" Тогда
		ОбработкаРезультатаПодбораПоПартиям(Форма, РезультатОповещения, Объект);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещения()

Процедура ОбработкаРезультатаПодбораНоменклатуры(Форма, ПараметрыПодбора, Объект = Неопределено)
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Получим параметры выполнения подбора
	ПодобраннаяНоменклатура = ПолучитьИзВременногоХранилища(ПараметрыПодбора.Корзина);
	ИмяТабличнойЧасти       = ПараметрыПодбора.ИмяТабличнойЧасти;
	ИмяРеквизитаКоличество  = ПараметрыПодбора.ИмяРеквизитаКоличество;
	ЕстьКоличество          = ЕстьРеквизит(Объект, ИмяРеквизитаКоличество, ИмяТабличнойЧасти);
	ЕстьЦена	            = ЕстьРеквизит(Объект, "Цена", ИмяТабличнойЧасти);    // laza
	ЕстьЕдиницаИзмерения 	= ЕстьРеквизит(Объект, "ЕдиницаИзмерения", ИмяТабличнойЧасти);
	ЕстьХарактеристика      = ЕстьРеквизит(Объект, "ХарактеристикаНоменклатуры", ИмяТабличнойЧасти);
	ЕстьЯчейка              = ПараметрыПодбора.ЕстьЯчейка И ЕстьРеквизит(Объект, "Ячейка", ИмяТабличнойЧасти);
	ТабличнаяЧастьОбъекта   = Объект[ИмяТабличнойЧасти];
	МенеджерДокумента       = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПараметрыПодбора.ПолноеИмяОбъекта);
	Если СтрНайти(Строка(МенеджерДокумента),"Справочник") > 0 Тогда
		Имя = СтрЗаменить(Строка(МенеджерДокумента), "СправочникМенеджер", "Справочники");
	Иначе
		Имя = СтрЗаменить(Строка(МенеджерДокумента), "ДокументМенеджер", "Документы");
	КонецЕсли;
	ЕстьВладелецХарактеристики = ЕстьРеквизит(Объект, "ВладелецХарактеристики", ИмяТабличнойЧасти);
	УказанВладелецХарактеристик = Ложь;

	// Формируем параметры поиска строки
	ПараметрыОтбора = Новый Структура("Номенклатура");
	Если ЕстьКоличество И ЕстьЕдиницаИзмерения Тогда
		ПараметрыОтбора.Вставить("ЕдиницаИзмерения");
	КонецЕсли;
	Если ЕстьХарактеристика Тогда
		ПараметрыОтбора.Вставить("ХарактеристикаНоменклатуры");
	КонецЕсли;
	Если ЕстьЯчейка Тогда
		ПараметрыОтбора.Вставить("Ячейка");
	КонецЕсли;
	
	// Производим перенос подобранной номенклатуры в табличную часть объекта
	Для Каждого СтрокаТоваров Из ПодобраннаяНоменклатура Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаТоваров);
		НайденныеСтроки = ТабличнаяЧастьОбъекта.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество()=0 Тогда
			
			// Добавим новую строку и заполним ее
			СтрокаТабличнойЧасти = ТабличнаяЧастьОбъекта.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТоваров);
			
			// Вызываем обработчик изменения данных объекта
			ПараметрыВыполнения = Новый Массив;
			ПараметрыВыполнения.Добавить(Объект);
			ПараметрыВыполнения.Добавить(СтрокаТабличнойЧасти);
			ПараметрыВыполнения.Добавить(ПараметрыПодбора.ПараметрыДействия);
			РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(Имя + "." + ИмяТабличнойЧасти + "НоменклатураПриИзменении", ПараметрыВыполнения);
			
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТоваров);
			Если ЕстьЦена Тогда 
				РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(Имя + "." + ИмяТабличнойЧасти + "ЦенаПриИзменении", ПараметрыВыполнения);
			КонецЕсли;
			
			// Если имя реквизита Количество отличается от стандартного, произведем дозаполнение.
			Если ЕстьКоличество И ((НЕ ИмяРеквизитаКоличество="Количество") ИЛИ СтрокаТоваров.Количество > 0) Тогда
				
				СтрокаТабличнойЧасти[ИмяРеквизитаКоличество] = СтрокаТоваров.Количество;
				
				ПараметрыВыполнения = Новый Массив;
				ПараметрыВыполнения.Добавить(Объект);
				ПараметрыВыполнения.Добавить(СтрокаТабличнойЧасти);
				ПараметрыВыполнения.Добавить(ПараметрыПодбора.ПараметрыДействия);
				РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(Имя + "." + ИмяТабличнойЧасти + ИмяРеквизитаКоличество + "ПриИзменении", ПараметрыВыполнения);
				
			КонецЕсли;
			
			Если ЕстьВладелецХарактеристики Тогда
				УказанВладелецХарактеристик = УказанВладелецХарактеристик
												ИЛИ (НЕ СтрокаТабличнойЧасти.ВладелецХарактеристики = Неопределено);
			КонецЕсли;
			
		ИначеЕсли ЕстьКоличество Тогда
			
			// Получим строку и увеличим в ней количество
			СтрокаТабличнойЧасти = НайденныеСтроки[0];
			СтрокаТабличнойЧасти[ИмяРеквизитаКоличество] = СтрокаТабличнойЧасти[ИмяРеквизитаКоличество] + СтрокаТоваров.Количество;
			
			// Вызываем обработчик изменения данных объекта
			ПараметрыВыполнения = Новый Массив;
			ПараметрыВыполнения.Добавить(Объект);
			ПараметрыВыполнения.Добавить(СтрокаТабличнойЧасти);
			ПараметрыВыполнения.Добавить(ПараметрыПодбора.ПараметрыДействия);
			РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(Имя + "." + ИмяТабличнойЧасти + ИмяРеквизитаКоличество +"ПриИзменении", ПараметрыВыполнения);
			
			// Теперь проверим, не была ли изменена в подборе цена
			Если ЕстьЦена Тогда 
				Если СтрокаТоваров.Цена <> СтрокаТабличнойЧасти.Цена Тогда 
					СтрокаТабличнойЧасти.Цена = СтрокаТоваров.Цена;
					РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(Имя + "." + ИмяТабличнойЧасти + "ЦенаПриИзменении", ПараметрыВыполнения);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	Если Объект.ХозОперация=Справочники.ХозОперации.ЗаказРезервированиеПокупателя Тогда
		СтрокаТабличнойЧасти.Резерв = СтрокаТабличнойЧасти.Количество; 
	КонецЕсли; 
		
	КонецЦикла;
	
	// Установим видимость колонки Характеристика
	Если НЕ Форма.Элементы.Найти(ИмяТабличнойЧасти+"ХарактеристикаНоменклатуры")=Неопределено И НЕ Форма.Элементы[ИмяТабличнойЧасти+"ХарактеристикаНоменклатуры"].Видимость Тогда
		
		СтрокиБезХарактеристик = ТабличнаяЧастьОбъекта.НайтиСтроки(Новый Структура("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()));
		Форма.Элементы[ИмяТабличнойЧасти+"ХарактеристикаНоменклатуры"].Видимость = (ТабличнаяЧастьОбъекта.Количество() <> СтрокиБезХарактеристик.Количество()) ИЛИ УказанВладелецХарактеристик;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаПодбораНоменклатуры()

// Общий обработчик события возникающего при выполнении оповещения о подборе партии.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
Процедура ОбработкаРезультатаПодбораПоПартиям(Форма, ПараметрыПодбора, Объект = Неопределено)
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Получим параметры выполнения подбора
	ПодобраннаяНоменклатура = ПолучитьИзВременногоХранилища(ПараметрыПодбора.АдресПодобраннойНоменклатурыВХранилище);
	МетаданныеОбъекта = УправлениеДиалогомСервер.ПолучитьМетаданныеОбъектаФормы(Форма);
	МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеОбъекта.ПолноеИмя());
	
	// Формируем параметры поиска строки
	ПараметрыОтбора = Новый Структура("Номенклатура");
	Если ЕстьРеквизит(Объект,"ДокументПродажи","Товары") Тогда
		ПараметрыОтбора.Вставить("ДокументПродажи");
		ИмяКолонки = "ДокументПродажи";
	ИначеЕсли ЕстьРеквизит(Объект,"ДокументПередачи","Товары") Тогда	
		ПараметрыОтбора.Вставить("ДокументПередачи");
		ИмяКолонки = "ДокументПередачи";
	Иначе
		ПараметрыОтбора.Вставить("Партия");
		ИмяКолонки = "Партия";
	КонецЕсли;
	ПараметрыОтбора.Вставить("ХарактеристикаНоменклатуры");
	
	Если Объект.ХозОперация=Справочники.ХозОперации.ОтчетКомиссионера Тогда
		ПараметрыОтбора.Вставить("ИдентификаторСтроки");
	КонецЕсли;
	
	// Производим перенос подобранной номенклатуры в табличную часть объекта
	Для Каждого СтрокаТоваров Из ПодобраннаяНоменклатура Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаТоваров);
		НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
		
		// смотрим что нашли
		Если НайденныеСтроки.Количество()>0 Тогда
			
			// Нашли такую строку, посмотрим, если мы определили для такой строки количество 0, то удалим ее.
			Если СтрокаТоваров.Количество=0 Тогда
				Объект.Товары.Удалить(НайденныеСтроки[0]);
				Продолжить;
			Иначе
				ТекСтрока = НайденныеСтроки[0];
			КонецЕсли;
			
		ИначеЕсли СтрокаТоваров.Количество>0 Тогда
			
			// Добавим подобранные товары
			ТекСтрока = Объект.Товары.Добавить();
			ТекСтрока.Номенклатура = СтрокаТоваров.Номенклатура;
			ТекСтрока.ХарактеристикаНоменклатуры = СтрокаТоваров.ХарактеристикаНоменклатуры;
		Иначе
			// строки такой нет, Количество=0, добавлять в тч не нужно
			Продолжить;
		КонецЕсли;
		
		
		// Вызываем обработчик изменения данных объекта
		МенеджерДокумента.ТоварыНоменклатураПриИзменении(Объект, ТекСтрока);
		
		ТекСтрока[ИмяКолонки] = СтрокаТоваров.Партия;
		Если ИмяКолонки="ДокументПродажи" Тогда
			МенеджерДокумента.ТоварыДокументПродажиПриИзменении(Объект, ТекСтрока);
		ИначеЕсли ИмяКолонки="ДокументПередачи" Тогда
			МенеджерДокумента.ТоварыДокументПередачиПриИзменении(Объект, ТекСтрока);
		Иначе
			МенеджерДокумента.ТоварыПартияПриИзменении(Объект, ТекСтрока);
		КонецЕсли; 
		
		ТекСтрока.Количество = СтрокаТоваров.Количество;
		МенеджерДокумента.ТоварыКоличествоПриИзменении(Объект, ТекСтрока);
		
		Если ПараметрыОтбора.Свойство("ИдентификаторСтроки") Тогда
			ТекСтрока.ИдентификаторСтроки = СтрокаТоваров.ИдентификаторСтроки;
		КонецЕсли;
		
		Форма.Модифицированность = Истина;
		
	КонецЦикла;
	
КонецПроцедуры // ОбработкаРезультатаПодбораПоПартиям()


////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ДЕРЕВОМ ПОДРАЗДЕЛЕНИЙ

// Рекурсивное заполнение дерева подразделений
//
Процедура ОбходДереваПодразделений(ЭлементФормыДерево, ЭлементыУровня, РезультатЗапроса)
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭлементыУровня.Добавить();
		НоваяСтрока.ПодразделениеКомпании = Выборка.Ссылка;
		НоваяСтрока.Пометка               = Выборка.Пометка;
		
		ОбходДереваПодразделений(ЭлементФормыДерево, НоваяСтрока.ПолучитьЭлементы(), Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

//Формирует дерево подразделений. Если объект уже записан и у него заполнена таблица подразделений, 
//то в дереве для выбранных подразделений устанавливается пометка.
//
Процедура ЗаполнитьДеревоПодразделений(Форма, Объект) Экспорт
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Подразделения.ПодразделениеКомпании
	|ПОМЕСТИТЬ
	|	Подразделения
	|ИЗ
	|	&Подразделения КАК Подразделения
	|;
	|
	|ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка,
	|	ВЫБОР
	|		КОГДА Подразделения.ПодразделениеКомпании ЕСТЬ NULL ТОГДА
	|			ЛОЖЬ
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ КАК Пометка
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Подразделения КАК Подразделения
	|ПО
	|	ПодразделенияКомпании.Ссылка = Подразделения.ПодразделениеКомпании
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделенияКомпании.Ссылка ИЕРАРХИЯ
	|";
	
	Запрос.УстановитьПараметр("Ссылка",        Объект.Ссылка);
	Запрос.УстановитьПараметр("Подразделения", Объект.Подразделения.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	ОбходДереваПодразделений(Форма.Элементы.ДеревоПодразделений, Форма.ДеревоПодразделений.ПолучитьЭлементы(), РезультатЗапроса);
	
КонецПроцедуры
